InformationRegisters/ПараметрыРаботыСДокументомПТУ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПараметрыРаботыСДокументомПТУ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЯчейкаПриемки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЯчейкаПриемкиГУИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДокументГУИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоставкаОтВнешнегоПоставщика</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НомерСкладскогоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>75</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПараметрыРаботыПриПеремещении.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПараметрыРаботыПриПеремещении</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЯчейкаКуда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЯчейкаКудаГУИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЯчейкаОткуда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЯчейкаОткудаГУИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/РежимВводаКоличества.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>РежимВводаКоличества</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Автоматический</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ручной</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ОбщегоНазначения_WSСсылки/Ext/Module.bsl
//ФУНКЦИОНАЛ РАбОТЫ С СЕРВЕРОМ ДАННЫХ

&НаСервере
Функция АвторизоватьПользователя(Штрихкод, Пароль, Адрес) Экспорт
	
	РезультатОтвета = ПолучитьСтруктуруОтвета();
	РезультатОтвета.Вставить("Результат", Ложь);
	
	Если Не ЗначениеЗаполнено(Штрихкод) И Не ЗначениеЗаполнено(Пароль) Тогда
		РезультатОтвета.Ошибка = "Сканируйте штрихкод сотрудника или введите пароль.";
		Возврат РезультатОтвета;
	КонецЕсли;
	

	Если Не ЗначениеЗаполнено(Адрес) Тогда
		РезультатОтвета.Ошибка = "Заполните адрес web-сервиса";
		Возврат РезультатОтвета;
	Иначе		
		Константы.Адрес.Установить(СокрЛП(Адрес));
	КонецЕсли;
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл
		
		Попытка
			WSПрокси = WSСсылки.ARMStoreKeeper.СоздатьWSПрокси("Data", "ARMStoreKeeper", "ARMStoreKeeperSoap", ,ПолучитьTimeout()); 		
			//WSПрокси.Пользователь = "webadmin";
			//WSПрокси.Пароль = "web";
			
			Ответ = WSПрокси.AuthenticationUser(Штрихкод, Пароль);	
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);
			
			Если НЕ ЗначениеЗаполнено(РезультатОтвета.Ошибка) Тогда
				
				Константы.Пользователь.Установить(РезультатОтвета.Данные.Пользователь);
				Константы.ПолноеИмя.Установить(РезультатОтвета.Данные.ПолноеИмя);
				Константы.ПользовательГУИД.Установить(РезультатОтвета.Данные.ПользовательГУИД);                               						
				Константы.Пароль.Установить(Пароль);
				Константы.Адрес.Установить(Адрес);                               			
				
				Прервать;
				
			КонецЕсли;
			
		Исключение
					
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");				
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "АвторизоватьПользователя");
			
		КонецПопытки;
		
	КонецЦикла; 	
	
	
	Возврат РезультатОтвета;
	
КонецФункции


&НаСервере
Функция ПолучитьСписокТоваровИзЯчейки( ЯчейкаГУИД) Экспорт
	
	РезультатОтвета = ПолучитьСтруктуруОтвета();
	UserIdGUID = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл	
		
		Попытка
			
			WSПрокси = WSСсылки.ARMStoreKeeper.СоздатьWSПрокси("Data", "ARMStoreKeeper", "ARMStoreKeeperSoap", ,ПолучитьTimeout()); 				
			//WSПрокси.Пользователь = "webadmin";
			//WSПрокси.Пароль = "web";				
			
			Ответ = WSПрокси.GetListGoodsFromCell(UserIdGUID, ЯчейкаГУИД);		
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);
			Если Не ЗначениеЗаполнено(РезультатОтвета.Ошибка) Тогда
				ЗаписатьРегистрСведений("СписокТоваровЯчейки", РезультатОтвета.Данные);
			КонецЕсли; 
						
			Прервать;                                                            
			
		Исключение
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");		
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ПолучитьСписокТоваровИзЯчейки");
			
		КонецПопытки;                              
		
	КонецЦикла;
	
	Возврат РезультатОтвета;
	
КонецФункции                                                 


&НаСервере
Функция СоздатьДокументПеремещенияМеждуЯчейкам( ЯчейкаОткудаGUID ) Экспорт
	
	РезультатОтвета = ПолучитьСтруктуруОтвета();
	UserIdGUID = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл	
		
		Попытка
			WSПрокси = WSСсылки.ARMStoreKeeper.СоздатьWSПрокси("Data", "ARMStoreKeeper", "ARMStoreKeeperSoap", ,ПолучитьTimeout()); 				
			//WSПрокси.Пользователь = "webadmin";
			//WSПрокси.Пароль = "web";				
			
			Ответ = WSПрокси.CreateDocumentMoveGood(UserIdGUID, ЯчейкаОткудаGUID);		
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);
			
			Прервать;                                                            
			
		Исключение
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");		
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "СоздатьДокументПеремещенияМеждуЯчейкам");
			
		КонецПопытки;                              
		
	КонецЦикла;
	
	Возврат РезультатОтвета;
	
КонецФункции                                                 


&НаСервере
Функция ПолучитьСписокЯчеекДляПеремещения() Экспорт
	
	РезультатОтвета = ПолучитьСтруктуруОтвета();
	UserIdGUID = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл	
		
		Попытка
			WSПрокси = WSСсылки.ARMStoreKeeper.СоздатьWSПрокси("Data", "ARMStoreKeeper", "ARMStoreKeeperSoap", ,ПолучитьTimeout()); 				
			//WSПрокси.Пользователь = "webadmin";
			//WSПрокси.Пароль = "web";				
			
			Ответ = WSПрокси.GetListMovesForCreateDocument(UserIdGUID);		
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);
			
			Прервать;
			
		Исключение
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");		
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ПолучитьСписокЯчеекДляПеремещения");
			
		КонецПопытки;                              
		
	КонецЦикла;
	
	Возврат РезультатОтвета;
	
КонецФункции
 

&НаСервере
Функция СоздатьДокуметРазмещенияПоЯчейкам( ДокументГУИД ) Экспорт
	
	РезультатОтвета = ПолучитьСтруктуруОтвета();
	ТипОперации = "ПриемкаТовара";
	UserIdGUID = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл	
		
		Попытка
			WSПрокси = WSСсылки.ARMStoreKeeper.СоздатьWSПрокси("Data", "ARMStoreKeeper", "ARMStoreKeeperSoap", ,ПолучитьTimeout()); 				
			//WSПрокси.Пользователь = "webadmin";
			//WSПрокси.Пароль = "web";				
			
			Ответ = WSПрокси.CreateDocument(ДокументГУИД, UserIdGUID, ТипОперации);		
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);
			
			Прервать;
			
		Исключение
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");		
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "СоздатьДокуметРазмещенияПоЯчейкам");
			
		КонецПопытки;                              
		
	КонецЦикла;
	
	Возврат РезультатОтвета;
	
КонецФункции


&НаСервере
Функция ПолучитьОстатокТовара(ТоварГУИД) Экспорт
	
	РезультатОтвета = ПолучитьСтруктуруОтвета(); 
	РезультатОтвета.Вставить("Результат", Ложь);
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл			
		
		Попытка
			WSПрокси = WSСсылки.ARMStoreKeeper.СоздатьWSПрокси("Data", "ARMStoreKeeper", "ARMStoreKeeperSoap", ,ПолучитьTimeout()); 						
			//WSПрокси.Пользователь = "webadmin";              
			//WSПрокси.Пароль = "web";		
			
			Ответ = WSПрокси.GetRemainderGood(ТоварГУИД);
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);				
			
			Прервать;
			
		Исключение
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ПолучитьОстатокТовара");
			
		КонецПопытки; 
		
	КонецЦикла;
	
	Возврат РезультатОтвета;
	
КонецФункции
 

&НаСервере
Функция ПолучитьОстатокПоВсемТоварамИзДокумента( ДокументГУИД ) Экспорт
	
	РезультатОтвета = ПолучитьСтруктуруОтвета();	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл	
			
		Попытка
			WSПрокси = WSСсылки.ARMStoreKeeper.СоздатьWSПрокси("Data", "ARMStoreKeeper", "ARMStoreKeeperSoap", ,ПолучитьTimeout()); 						
			
			Ответ = WSПрокси.GetRemainderForAllGoodsFromDocument(ДокументГУИД);		
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);			
			Если Не ЗначениеЗаполнено(РезультатОтвета.Ошибка) Тогда
				ЗаписатьРегистрСведений("СписокТоваровДокументаПТУ", РезультатОтвета.Данные);
			КонецЕсли; 
			
			Прервать;
			
		Исключение
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");		
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ПолучитьОстатокПоВсемТоварамИзДокумента");
			
		КонецПопытки;                              
		
	КонецЦикла;
		
	Возврат РезультатОтвета;
	
КонецФункции


&НаСервере
Функция ПолучитьОстатокПоТоваруВЯчейке(ЯчейкаГУИД, Штрихкод, ТоварГУИД) Экспорт
	
	РезультатОтвета = ПолучитьСтруктуруОтвета();	
	UserIdGUID = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл	
				
		Попытка
			WSПрокси = WSСсылки.ARMStoreKeeper.СоздатьWSПрокси("Data", "ARMStoreKeeper", "ARMStoreKeeperSoap", ,ПолучитьTimeout()); 				
			//WSПрокси.Пользователь = "webadmin";
			//WSПрокси.Пароль = "web";		

			Ответ = WSПрокси.GetRemainderGoodFromCell(UserIdGUID, ЯчейкаГУИД, Штрихкод, ТоварГУИД);			
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);		
			
			Прервать;
			
		Исключение
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");		
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ПолучитьОстатокПоТоваруИзДокумента");
			
		КонецПопытки; 
		
	КонецЦикла;
	
	Возврат РезультатОтвета;                                
	
КонецФункции                                                                                


//|	ТоварВДокументе.Количество КАК КоличествоВДокументе,
//|	БуферРС.Quantity КАК КоличествоВБуфере,
//|	ТоварВДокументе.Номенклатура КАК СсылкаТовара
&НаСервере
Функция ПолучитьОстатокПоТоваруИзДокумента(ДокументГУИД, Штрихкод, ТоварГУИД) Экспорт
	
	РезультатОтвета = ПолучитьСтруктуруОтвета();
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл	
				
		Попытка
			WSПрокси = WSСсылки.ARMStoreKeeper.СоздатьWSПрокси("Data", "ARMStoreKeeper", "ARMStoreKeeperSoap", ,ПолучитьTimeout()); 				
			//WSПрокси.Пользователь = "webadmin";
			//WSПрокси.Пароль = "web";		
			
			Ответ = WSПрокси.GetRemainderForGoodFromDocument(ДокументГУИД, Штрихкод, ТоварГУИД);		
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);		
			
			Прервать;
			
		Исключение
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");		
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ПолучитьОстатокПоТоваруИзДокумента");
			
		КонецПопытки; 
		
	КонецЦикла;
	
	Возврат РезультатОтвета;                                
	
КонецФункции                                                                                
 

&НаСервере
Функция ПрисвоитьШтрихкодТовару(Штрихкод, ГУИДТовара) Экспорт
	
	РезультатОтвета = ПолучитьСтруктуруОтвета();
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл		
		
		Попытка
			WSПрокси = WSСсылки.ARMStoreKeeper.СоздатьWSПрокси("Data", "ARMStoreKeeper", "ARMStoreKeeperSoap", ,ПолучитьTimeout()); 				
			//WSПрокси.Пользователь = "webadmin";
			//WSПрокси.Пароль = "web";		
			
			Ответ = WSПрокси.AddBarcodeForGood(Штрихкод, ГУИДТовара);		
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);		
			
			Прервать;
			
		Исключение		
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");		
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ПрисвоитьШтрихкодТовару");
			
		КонецПопытки; 
		
	КонецЦикла;		
		
	Возврат РезультатОтвета;	
	
КонецФункции
 

&НаСервере
Процедура УстановитьВерсиюСервисаСервера() Экспорт
	
	Версия = 0;
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл		
			
		Попытка
			WSПрокси = WSСсылки.ARMStoreKeeper.СоздатьWSПрокси("Data", "ARMStoreKeeper", "ARMStoreKeeperSoap", ,ПолучитьTimeout()); 				
			//WSПрокси.Пользователь = "webadmin";
			//WSПрокси.Пароль = "web";
			//Версия = WSПрокси.ПолучитьВерсиюВебСервиса();	
			Версия = WSПрокси.GetVesionWebService(); 			
			Прервать;
			
		Исключение
		КонецПопытки;		
		
	КонецЦикла;
	
	Попытка		
		Если Версия > 0 Тогда	
			Константы.Версия.Установить(Версия);
		КонецЕсли;		
	Исключение
	КонецПопытки;
	
КонецПроцедуры    


&НаСервере
Функция ПолучитьЯчейку(Ячейка) Экспорт
	
	РезультатОтвета = ПолучитьСтруктуруОтвета();
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл		
			
		Попытка
			WSПрокси = WSСсылки.ARMStoreKeeper.СоздатьWSПрокси("Data", "ARMStoreKeeper", "ARMStoreKeeperSoap", ,ПолучитьTimeout()); 						
			//WSПрокси.Пользователь = "webadmin";
			//WSПрокси.Пароль = "web";		
			
			Ответ = WSПрокси.GetCell(Ячейка);		
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);		
			
			Прервать;
			
		Исключение
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");		
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ПолучитьЯчейку");			
			
		КонецПопытки; 
		
	КонецЦикла;
	
	Возврат РезультатОтвета;
	
КонецФункции

&НаСервере
Функция ЗагрузитьСписокТовараДокументаПТУ(СсылкаТовара) Экспорт
	
	РезультатОтвета = ПолучитьСтруктуруОтвета(); 
	РезультатОтвета.Вставить("Результат", Ложь);
	
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл		
			
		Попытка
			WSПрокси = WSСсылки.ARMStoreKeeper.СоздатьWSПрокси("Data", "ARMStoreKeeper", "ARMStoreKeeperSoap", ,ПолучитьTimeout()); 						
			
			Ответ = WSПрокси.GetListGoodsFromPTU(СсылкаТовара);		
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);				
			Если Не ЗначениеЗаполнено(РезультатОтвета.Ошибка) Тогда
				ЗаписатьРегистрСведений("СписокТоваровДокументаПТУ", РезультатОтвета.Данные);
			КонецЕсли; 
			
			Прервать;
			
		Исключение
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");		
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ЗагрузитьСписокТовараДокументаПТУ");			
						
		КонецПопытки; 
		
	КонецЦикла;
	
	Возврат РезультатОтвета;
	
КонецФункции


&НаСервере
Функция ЗагрузитьСписокДокументовПТУ() Экспорт
	
	РезультатОтвета = ПолучитьСтруктуруОтвета();
	РезультатОтвета.Вставить("Результат", Ложь);
	ПользовательГУИД = ОбщегоНазначения.ПолучитьПользователяГУИД();
	
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл		
	
		Попытка
			WSПрокси = WSСсылки.ARMStoreKeeper.СоздатьWSПрокси("Data", "ARMStoreKeeper", "ARMStoreKeeperSoap", ,ПолучитьTimeout()); 		
			//WSПрокси.Пользователь = "webadmin";
			//WSПрокси.Пароль = "web";		
			
			Ответ = WSПрокси.GetListOfDocumentsPTU(ПользовательГУИД);
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);		
			
			Если Не ЗначениеЗаполнено(РезультатОтвета.Ошибка) Тогда
				ЗаписатьРегистрСведений("СписокДокументовПТУ", РезультатОтвета.Данные);
			КонецЕсли; 
			
			Прервать;
			
		Исключение
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ЗагрузитьСписокДокументовПТУ");			
		КонецПопытки; 
		
	КонецЦикла;
		                                                       
	Возврат РезультатОтвета;
	
КонецФункции

&НаСервере
Функция ЗаписатьРегистрСведений(ИмяРегистра, СписокДанных)
	
	РегСведНабор = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
	РегСведНабор.Прочитать();
	РегСведНабор.Очистить();
	                                                    
	Для каждого Данные Из СписокДанных Цикл
		
		НоваяЗапись = РегСведНабор.Добавить();	
		
		ЗаполнитьЗначенияСвойств(НоваяЗапись, Данные);		
		Если ИмяРегистра = "СписокДокументовПТУ" Тогда
			НоваяЗапись.ДатаДокумента = ПреобразоватьДату(Данные.ДатаДокумента);
		КонецЕсли;			
		НоваяЗапись.ДатаЗагрузки = ТекущаяДата();		
	КонецЦикла; 
	
	РегСведНабор.Записать(Истина);
	
КонецФункции

&НаСервере
Функция ПреобразоватьДату(СтроковаяДата)
	
	СтроковаяДата = СтрЗаменить(СтроковаяДата , "-",""); 
	СтроковаяДата = СтрЗаменить(СтроковаяДата , ":","");
	СтроковаяДата = СтрЗаменить(СтроковаяДата , "T","");
	Возврат Дата(СтроковаяДата);
	
КонецФункции

&НаСервере
Процедура ОчиститьРегистрСведений(ИмяРегистра) Экспорт
	
	РегСведНабор = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
	РегСведНабор.Прочитать();
	РегСведНабор.Очистить();
	РегСведНабор.Записать();

КонецПроцедуры


/////////////////////////////////////////////////////////////////////////////////////////////////////////
#Область ПараметрыРаботы

&НаСервере
Процедура ЗаписатьПараметрыРаботы( ИмяРегистра, ПараметрыРаботы ) Экспорт
	                                   
	МенеджерЗаписи = РегистрыСведений[ИмяРегистра].СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Прочитать();
	Для каждого Элемент Из ПараметрыРаботы Цикл
		
		МенеджерЗаписи[Элемент.Ключ] = Элемент.Значение;
		
	КонецЦикла; 	
	
	МенеджерЗаписи.Записать();		
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыРаботыСДокументомПТУ() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПараметрыРаботыСДокументомПТУ.НомерСкладскогоДокумента КАК НомерСкладскогоДокумента,
	|	ПараметрыРаботыСДокументомПТУ.ЯчейкаПриемки КАК ЯчейкаПриемки,
	|	ПараметрыРаботыСДокументомПТУ.ЯчейкаПриемкиГУИД КАК ЯчейкаПриемкиГУИД,
	|	ПараметрыРаботыСДокументомПТУ.ДокументГУИД КАК ДокументГУИД
	|ИЗ
	|	РегистрСведений.ПараметрыРаботыСДокументомПТУ КАК ПараметрыРаботыСДокументомПТУ";
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	РезультатЗапроса.Следующий();
			 
	ПараметрыРаботы = Новый Структура;
	
	ПараметрыРаботы.Вставить( "НомерСкладскогоДокумента", РезультатЗапроса.НомерСкладскогоДокумента);
	ПараметрыРаботы.Вставить( "ЯчейкаПриемки", РезультатЗапроса.ЯчейкаПриемки);
	ПараметрыРаботы.Вставить( "ЯчейкаПриемкиГУИД", РезультатЗапроса.ЯчейкаПриемкиГУИД);
	ПараметрыРаботы.Вставить( "ДокументГУИД", РезультатЗапроса.ДокументГУИД);
	
	Возврат ПараметрыРаботы;
	
КонецФункции

&НаСервере
Процедура ОчиститьПараметрыРаботы() Экспорт
	                                        
	РегСведНабор = РегистрыСведений.ПараметрыРаботыСДокументомПТУ.СоздатьНаборЗаписей();
	РегСведНабор.Записать();
	
	РегСведНабор = РегистрыСведений.ПараметрыРаботыПриПеремещении.СоздатьНаборЗаписей();
	РегСведНабор.Записать();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыРаботыПриПеремещении() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПараметрыРаботыПриПеремещении.ЯчейкаКуда КАК ЯчейкаКуда,
	|	ПараметрыРаботыПриПеремещении.ЯчейкаКудаГУИД КАК ЯчейкаКудаГУИД,
	|	ПараметрыРаботыПриПеремещении.ЯчейкаОткуда КАК ЯчейкаОткуда,
	|	ПараметрыРаботыПриПеремещении.ЯчейкаОткудаГУИД КАК ЯчейкаОткудаГУИД
	|ИЗ
	|	РегистрСведений.ПараметрыРаботыПриПеремещении КАК ПараметрыРаботыПриПеремещении";
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	РезультатЗапроса.Следующий();
			 
	ПараметрыРаботы = Новый Структура;
	
	ПараметрыРаботы.Вставить( "ЯчейкаКуда", РезультатЗапроса.ЯчейкаКуда);
	ПараметрыРаботы.Вставить( "ЯчейкаКудаГУИД", РезультатЗапроса.ЯчейкаКудаГУИД);
	ПараметрыРаботы.Вставить( "ЯчейкаОткуда", РезультатЗапроса.ЯчейкаОткуда);
	ПараметрыРаботы.Вставить( "ЯчейкаОткудаГУИД", РезультатЗапроса.ЯчейкаОткудаГУИД);
	
	Возврат ПараметрыРаботы;
	
КонецФункции

#КонецОбласти 

/////////////////////////////////////////////////////////////////////////////////////////////////////////


#Область Константы

&НаСервере
Функция ПолучитьАдрес() Экспорт
	
	Возврат Константы.Адрес.Получить();

КонецФункции

&НаСервере
Процедура УстановитьНачальныеПараметры() Экспорт
	
	Если Не ЗначениеЗаполнено(Константы.КоличествоПопытокПодключения.Получить()) Тогда
		Константы.КоличествоПопытокПодключения.Установить(2);
	КонецЕсли; 
	
	Константы.РежимВводаКоличества.Установить( Перечисления.РежимВводаКоличества.Автоматический );
	
	Если Не ЗначениеЗаполнено( СокрЛП(Константы.ПутьДоЗвукФайлаОшибки.Получить()) )  Тогда
		
		ПутьДоФайла = "/storage/emulated/0/Install/SoundsFile/Error-converted.mp3";
		Константы.ПутьДоЗвукФайлаОшибки.Установить(ПутьДоФайла);
		
	КонецЕсли; 
	
	
	Если Не ЗначениеЗаполнено( СокрЛП(Константы.ПутьДоЗвукЯчейки.Получить()) )  Тогда
		
		ПутьДоФайла = "/storage/emulated/0/Install/SoundsFile/Cell-converted.mp3";
		Константы.ПутьДоЗвукЯчейки.Установить(ПутьДоФайла);
		
	КонецЕсли; 
	
	Константы.Timeout.Установить( 60 );	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПутьДоЗвукФайлаОшибки() Экспорт
	Возврат Константы.ПутьДоЗвукФайлаОшибки.Получить();
КонецФункции

&НаСервере
Функция ПолучитьПутьДоЗвукФайлаЯчейки() Экспорт
	Возврат Константы.ПутьДоЗвукЯчейки.Получить();
КонецФункции

&НаСервере
Функция ПолучитьКоличествоПопытокПодключения() Экспорт
	
	Возврат Константы.КоличествоПопытокПодключения.Получить();
	
КонецФункции

&НаСервере
Функция ПолучитьНаименованиеСотрудника() Экспорт 
	
	Возврат Константы.ПолноеИмя.Получить();
		
КонецФункции                                                                        

&НаСервере
Процедура ОчиститьКонстантыПоПользователю() Экспорт
	
	Константы.Пароль.Установить("");
	Константы.ПолноеИмя.Установить("");	
	Константы.Пароль.Установить("");	
	Константы.ПользовательГУИД.Установить("");
	
КонецПроцедуры

&НаСервере
Функция УстановленРежимВводаАвтоматический() Экспорт
	Если Константы.РежимВводаКоличества.Получить() =  Перечисления.РежимВводаКоличества.Автоматический Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли; 
КонецФункции

&НаСервере
Функция УстановленРежимВводаРучной() Экспорт
	Если Константы.РежимВводаКоличества.Получить() =  Перечисления.РежимВводаКоличества.Ручной Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли; 
КонецФункции



&НаСервере
Процедура УстановитьРежимВводаНаСервере() Экспорт 
	
	Если Константы.РежимВводаКоличества.Получить() = Перечисления.РежимВводаКоличества.Автоматический Тогда
		Константы.РежимВводаКоличества.Установить(Перечисления.РежимВводаКоличества.Ручной);
	Иначе 
		Константы.РежимВводаКоличества.Установить(Перечисления.РежимВводаКоличества.Автоматический);	
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПользователяГУИД() Экспорт
	Возврат Константы.ПользовательГУИД.Получить();
КонецФункции

&НаСервере
Функция УстановитьПользователя(Пользователь, ПользовательГУИД) Экспорт
	Константы.ПользовательГУИД.Установить(ПользовательГУИД);
	Константы.Пользователь.Установить(Пользователь);
КонецФункции

#КонецОбласти 
/////////////////////////////////////////////////////////////////////////////////////////////////////////


/////////////////////////////////////////////////////////////////////////////////////////////////////////
#Область СериализацияJSON

&НаСервере
Функция ДанныеВJSONХранилище(Данные) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Данные);
	JsonСтрока = ЗаписьJSON.Закрыть(); 	
	
	ДанныеВозврат = Новый ХранилищеЗначения(JsonСтрока, Новый СжатиеДанных(9));
	
	Возврат ДанныеВозврат;
	
КонецФункции

&НаСервере
Функция ХранилищеJSONВСтруктуру(Данные) Экспорт
	
	ДанныеТекст = Данные.Получить();
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ДанныеТекст);
	ДанныеСтруктура = ПрочитатьJSON(ЧтениеJSON);
	
	Возврат ДанныеСтруктура;
	
КонецФункции

#КонецОбласти 
/////////////////////////////////////////////////////////////////////////////////////////////////////////


&НаСервере
Функция ЕстьЛиТоварВЯчейке(ЯчейкаГУИД, ТоварГУИД) Экспорт
	
	РезультатОтвета = ПолучитьСтруктуруОтвета(); 
	РезультатОтвета.Вставить("Результат", Ложь);
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл			
		
		Попытка
			WSПрокси = WSСсылки.ARMStoreKeeper.СоздатьWSПрокси("Data", "ARMStoreKeeper", "ARMStoreKeeperSoap", ,ПолучитьTimeout()); 						
			//WSПрокси.Пользователь = "webadmin";              
			//WSПрокси.Пароль = "web";		
			
			Ответ = WSПрокси.IsGoodInCell(ЯчейкаГУИД, ТоварГУИД);
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);				
			
			Прервать;
			
		Исключение
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ЕстьЛиТоварВЯчейке");
			
		КонецПопытки; 
		
	КонецЦикла;
	
	Возврат РезультатОтвета;
	
КонецФункции


&НаСервере
Функция ЕстьЛиТоварыВЯчейке(ЯчейкаГУИД) Экспорт
	
	РезультатОтвета = ПолучитьСтруктуруОтвета(); 
	РезультатОтвета.Вставить("Результат", Ложь);
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл			
		
		Попытка
			WSПрокси = WSСсылки.ARMStoreKeeper.СоздатьWSПрокси("Data", "ARMStoreKeeper", "ARMStoreKeeperSoap", ,ПолучитьTimeout()); 						
			//WSПрокси.Пользователь = "webadmin";              
			//WSПрокси.Пароль = "web";		
			
			Ответ = WSПрокси.IsGoodsInCell(ЯчейкаГУИД);
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);				
			
			Прервать;
			
		Исключение
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ЕстьЛиТоварыВЯчейке");
			
		КонецПопытки; 
		
	КонецЦикла;
	
	Возврат РезультатОтвета;
	
КонецФункции
 
&НаСервере
Функция ДобавитьТоварВБуферАРМКладовщика(ОбъектГУИД, ТоварГУИД, ПользовательГУИД, ДатаСоздания, Штрихкод, Количество, ЯчейкаПриемникГУИД, ВведеноВРучную = Ложь) Экспорт

	РезультатОтвета = ПолучитьСтруктуруОтвета();
	РезультатОтвета.Вставить("Результат", Ложь);
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл			
	
		Попытка
			WSПрокси = WSСсылки.ARMStoreKeeper.СоздатьWSПрокси("Data", "ARMStoreKeeper", "ARMStoreKeeperSoap", ,ПолучитьTimeout()); 						
			//WSПрокси.Пользователь = "webadmin";              
			//WSПрокси.Пароль = "web";		
									 
			Ответ = WSПрокси.AddBufferARMStoreKeeper(ОбъектГУИД, ТоварГУИД, ПользовательГУИД, ДатаСоздания, Штрихкод, Количество,ЯчейкаПриемникГУИД, ВведеноВРучную);
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);				
			
			Прервать;
			
		Исключение	
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");               		
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ДобавитьТоварВБуферАРМКладовщика");
			
		КонецПопытки; 
		
	КонецЦикла;	
	
	Возврат РезультатОтвета;	
	
КонецФункции

&НаСервере
Функция ДобавитьТоварВБуферАРМКладовщикаПеремещение(ПользовательГУИД, ЯчейкаОткудаГУИД, ТоварГУИД, ДатаСоздания, Штрихкод, Количество, ЯчейкаКудаГУИД, ВведеноВРучную) Экспорт

	РезультатОтвета = ПолучитьСтруктуруОтвета();
	РезультатОтвета.Вставить("Результат", Ложь);
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл			
	
		Попытка
			WSПрокси = WSСсылки.ARMStoreKeeper.СоздатьWSПрокси("Data", "ARMStoreKeeper", "ARMStoreKeeperSoap", ,ПолучитьTimeout()); 						
			//WSПрокси.Пользователь = "webadmin";              
			//WSПрокси.Пароль = "web";		
									 
			Ответ = WSПрокси.AddBufferMovingARMStoreKeeper(ПользовательГУИД, ЯчейкаОткудаГУИД, ТоварГУИД, ДатаСоздания, Штрихкод, Количество, ЯчейкаКудаГУИД, ВведеноВРучную);
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);				
			
			Прервать;
			                                                                   
		Исключение	
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");               		
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ДобавитьТоварВБуферАРМКладовщика");
			
		КонецПопытки; 
		
	КонецЦикла;	
	
	Возврат РезультатОтвета;	
	
КонецФункции




//FindGoodByBarcode 
//|	ВТШтрихкоды.Ссылка КАК Владелец,
//|	ВТШтрихкоды.ТипСтрокиЗапроса,
//|	Номенклатура.Наименование,
//|	&Штрихкод КАК Штрихкод,
//|	Номенклатура.КодПроизводителя,
//|	ЕдиницыИзмерения.Наименование КАК ЕдИзмНаименование,
//|	Номенклатура.Код КАК Код,
//|	Номенклатура.Кратность КАК Кратность	
&НаСервере
Функция НайтиТоварПоШтрихкоду(Штрихкод, ТипДокумента, ДокументГУИД, ТоварГУИД) Экспорт
	
	РезультатОтвета = ПолучитьСтруктуруОтвета(); 
	РезультатОтвета.Вставить("Результат", Ложь);
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл			
		
		Попытка
			WSПрокси = WSСсылки.ARMStoreKeeper.СоздатьWSПрокси("Data", "ARMStoreKeeper", "ARMStoreKeeperSoap", ,ПолучитьTimeout()); 						
			//WSПрокси.Пользователь = "webadmin";              
			//WSПрокси.Пароль = "web";		
			
			Ответ = WSПрокси.FindGoodByBarcode50(Штрихкод, ТипДокумента, ДокументГУИД, ТоварГУИД);
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);				
			
			Прервать;
			
		Исключение
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "НайтиТоварПоШтрихкоду");
			
		КонецПопытки; 
		
	КонецЦикла;
	
	Возврат РезультатОтвета;
	                                                                       
КонецФункции

&НаСервере
Функция ЗаменитьНедопустимыеСимволыXML(Знач Текст, СимволЗамены = "") Экспорт
	
	ПозицияНачала = 1;
	
	Пока Истина Цикл
		
		Позиция = НайтиНедопустимыеСимволыXML(Текст, ПозицияНачала);
		
		Если Позиция = 0 Тогда
			Прервать;
		КонецЕсли;
		
		Если Позиция > 1 Тогда
			
			НедопустимыйСимвол = Сред(Текст, Позиция - 1, 1);
			
			Если НайтиНедопустимыеСимволыXML(НедопустимыйСимвол) > 0 Тогда
				Текст = СтрЗаменить(Текст, НедопустимыйСимвол, СимволЗамены);
			КонецЕсли;
			
		КонецЕсли;
		
		НедопустимыйСимвол = Сред(Текст, Позиция, 1);
		
		Если НайтиНедопустимыеСимволыXML(НедопустимыйСимвол) > 0 Тогда
			Текст = СтрЗаменить(Текст, НедопустимыйСимвол, СимволЗамены);
		КонецЕсли;
		
		ПозицияНачала = Позиция + 1;
		
	КонецЦикла;

	Возврат Текст;
КонецФункции

&НаСервере                                                                   
Функция ПолучитьЗначениеШтрихкода(Значение) Экспорт
	Структура  = Новый Структура("Ошибка, Штрихкод", "", ""); 	    
	
	Попытка
		
		СимволРазделитель = Символ(29);
		Пока НЕ СтрНайти(Значение,СимволРазделитель) = 0 Цикл
			Значение = СтрЗаменить(Значение,СимволРазделитель,"");
		КонецЦикла;
		
		СимволРазделитель = "&#29;";
		Пока НЕ СтрНайти(Значение,СимволРазделитель) = 0 Цикл
			Значение = СтрЗаменить(Значение,СимволРазделитель,"");
		КонецЦикла;

	    Значение = ЗаменитьНедопустимыеСимволыXML(Значение);
		
		ЧтениеXML = Новый ЧтениеXML;		
		ЧтениеXML.УстановитьСтроку(Значение);

		ПостроительDOM = Новый ПостроительDOM;			
		ДокументDOM = ПостроительDOM.Прочитать(ЧтениеXML);
		
		//Разыменователь = Новый РазыменовательПространствИменDOM(ДокументDOM);
		РазыменовательПИ = ДокументDOM.СоздатьРазыменовательПИ(ДокументDOM);
		ЗапросXPath = "/MessageData/FilterData";
		Путь = ДокументDOM.СоздатьВыражениеXPath(ЗапросXPath, РазыменовательПИ);
		РезультатPath = Путь.Вычислить(ДокументDOM);    
		ОбработкаРезультата = РезультатPath.ПолучитьСледующий();
			
	Исключение                                                   
		Структура.Вставить("Ошибка", ОписаниеОшибки()+ СокрЛП(Значение));
		Возврат Структура;
	КонецПопытки; 
	
	Если ОбработкаРезультата.ТекстовоеСодержимое = "READ_FAIL" Тогда
		
		Структура.Вставить("Ошибка", "Ошибка сканирования штрихкода - " + ОбработкаРезультата.ТекстовоеСодержимое);
		Возврат Структура;
		
	КонецЕсли; 
	
	Структура.Вставить("Штрихкод", ОбработкаРезультата.ТекстовоеСодержимое);
	
	Возврат Структура;
	
КонецФункции

&НаСервере
Функция ПолучитьСтруктуруОтвета()
	
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("Ошибка", "");
	СтруктураОтвета.Вставить("Результат", Ложь);	
	СтруктураОтвета.Вставить("Данные", "");
	СтруктураОтвета.Вставить("ТипДанныхРезультат", "");
	
	Возврат СтруктураОтвета;
	
КонецФункции
  

&НаСервере
Функция ПолучитьНайденныеТоварыПоВведенномуЗначению(ЗначениеДляПоиска, ТипДокумента, ДокументГУИД, ТоварГУИД= "") Экспорт
	
	РезультатОтвета = ПолучитьСтруктуруОтвета();
	
	Для НомерПопытки = 1 По Константы.КоличествоПопытокПодключения.Получить() Цикл			
		
		Попытка
			WSПрокси = WSСсылки.ARMStoreKeeper.СоздатьWSПрокси("Data", "ARMStoreKeeper", "ARMStoreKeeperSoap", ,ПолучитьTimeout()); 						
			//WSПрокси.Пользователь = "webadmin";              
			//WSПрокси.Пароль = "web";		
									 
			Ответ = WSПрокси.FindGoodByBarcode50(ЗначениеДляПоиска, ТипДокумента, ДокументГУИД, ТоварГУИД);
			РезультатОтвета = ОбработатьОтветWebService(РезультатОтвета, Ответ);

			Прервать;
			
		Исключение                                                                          
			
			РезультатОтвета.Вставить("Ошибка", "Ошибка получения данных.");               		
			ASK_ОбработкаОшибок.Ошибка("#Ошибка подключения к Web Service", "Ошибка получения данных." + ОписаниеОшибки(), "ПолучитьНайденныеТоварыПоВведенномуЗначению");
			
		КонецПопытки;  
				
	КонецЦикла;
	
	Возврат РезультатОтвета;
	
КонецФункции

 
&НаСервере
Функция ОбработатьОтветWebService(РезультатОтвета, Ответ)
 
	Если ТипЗнч(Ответ) = Тип("ХранилищеЗначения") Тогда
		
		Данные = ХранилищеJSONВСтруктуру(Ответ);
		ЗначениеОшибки = "";
		
		Если ТипЗнч(Данные) = Тип("Структура") и Данные.Свойство("Ошибка",ЗначениеОшибки)  Тогда
			
			Если ЗначениеЗаполнено(ЗначениеОшибки) Тогда				
				
				РезультатОтвета.Вставить("Результат", Ложь);
				РезультатОтвета.Вставить("Ошибка", Данные.Ошибка);				
				Возврат РезультатОтвета;
				
			КонецЕсли; 
			
		КонецЕсли; 				
		
		РезультатОтвета.Вставить("Данные", Данные);
		РезультатОтвета.Вставить("Результат", Истина);
		
	ИначеЕсли ТипЗнч(Ответ) = Тип("Строка") И ЗначениеЗаполнено(Ответ) Тогда
			
		РезультатОтвета.Вставить("Данные", Ответ);							
		РезультатОтвета.Вставить("Результат", Истина);
		
	ИначеЕсли ТипЗнч(Ответ) = Тип("Boolean") Тогда
					
		РезультатОтвета.Вставить("Данные", Ответ);
		РезультатОтвета.Вставить("Результат", Истина);                      
		
	ИначеЕсли ТипЗнч(Ответ) = Тип("Число") Тогда
					
		РезультатОтвета.Вставить("Данные", Ответ);
		РезультатОтвета.Вставить("Результат", Истина);                      
		
	Иначе                                                                 
		
		РезультатОтвета.Вставить("Результат", Ложь);
		РезультатОтвета.Вставить("Ошибка", "Некорректные данные.");				
		
	КонецЕсли; 	
	
	Возврат РезультатОтвета;
	
КонецФункции
